/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: codmat23 <codmat23@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/09/18 17:56:00 by codmat23          #+#    #+#             */
/*   Updated: 2024/10/04 11:07:13 by codmat23         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Fonction qui retourne 1 si le caractère 'c' est un caractère imprimable,
// sinon 0
int	ft_isprint(int c)
{
	return (c >= ' ' && c <= '~');
}
